In [1]:
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost/mydb

In [3]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/mydb
14 rows affected.

[('customerdata',),
 ('customers',),
 ('customersdetails',),
 ('customertransactions',),
 ('drivers',),
 ('employee_basic_view',),
 ('employees',),
 ('high_employee_details',),
 ('high_paid_employees',),
 ('orders',),
 ('rides',),
 ('rides1',),
 ('rides2',),
 ('users',)]

In [4]:
%%sql
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100),
    hire_date DATE,
    job_title VARCHAR(50),
    salary DECIMAL(10, 2)
);

INSERT INTO employees (employee_id, first_name, last_name, email, hire_date, job_title, salary)
VALUES
(1, 'John', 'Doe', 'john.doe@example.com', '2022-05-01', 'Software Engineer', 85000.00),
(2, 'Jane', 'Smith', 'jane.smith@example.com', '2023-03-15', 'Data Scientist', 92000.00),
(3, 'Alice', 'Johnson', 'alice.johnson@example.com', '2024-05-01', 'Engineer', 95000.00),
(4, 'Mark', 'Taylor', 'mark.taylor@example.com', '2022-11-15', 'Manager', 100000.00),
(5, 'Gowtham', 'sb', 'mark.taylor@example.com', '2022-11-15', 'Data Engineer', 100000.00),
(6, 'Peter', 'sb', 'mark.taylor@example.com', '2022-11-15', 'Data Engineer', 120000.00);

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'employees' already exists
[SQL: CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    email VARCHAR(100),
    hire_date DATE,
    job_title VARCHAR(50),
    salary DECIMAL(10, 2)
);]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [5]:
%%sql #VIEW FUCNTION
CREATE VIEW employee_basic_view AS
SELECT
    employee_id,
    first_name,
    last_name,
    job_title
FROM employees;

 * mysql+mysqlconnector://root:***@localhost/mydb
(mysql.connector.errors.ProgrammingError) 1050 (42S01): Table 'employee_basic_view' already exists
[SQL: #VIEW FUCNTION
CREATE VIEW employee_basic_view AS
SELECT
    employee_id,
    first_name,
    last_name,
    job_title
FROM employees;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql
select * from employee_basic_view

 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[(1, 'John Doe', 'Software Engineer', Decimal('85000.00')),
 (2, 'Jane Smith', 'Data Scientist', Decimal('92000.00')),
 (3, 'Alice Johnson', 'Engineer', Decimal('95000.00')),
 (4, 'Mark Taylor', 'Manager', Decimal('100000.00')),
 (5, 'Gowtham sb', 'Data Engineer', Decimal('100000.00')),
 (6, 'Peter sb', 'Data Engineer', Decimal('120000.00'))]

In [7]:
%%sql
-- this is how view works when you dont want to show your logic to others you can do like this only the output shows insted of large logics behind it

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [8]:
%%sql
CREATE OR REPLACE VIEW employee_basic_view AS
SELECT 
    employee_id,
    CONCAT(first_name, ' ', last_name) AS full_name,
    job_title,
    salary
FROM employees;

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [9]:
%%sql
select * from employee_basic_view

 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[(1, 'John Doe', 'Software Engineer', Decimal('85000.00')),
 (2, 'Jane Smith', 'Data Scientist', Decimal('92000.00')),
 (3, 'Alice Johnson', 'Engineer', Decimal('95000.00')),
 (4, 'Mark Taylor', 'Manager', Decimal('100000.00')),
 (5, 'Gowtham sb', 'Data Engineer', Decimal('100000.00')),
 (6, 'Peter sb', 'Data Engineer', Decimal('120000.00'))]

In [10]:
%%sql
select * from employees

 * mysql+mysqlconnector://root:***@localhost/mydb
6 rows affected.

[(1, 'John', 'Doe', 'john.doe@example.com', datetime.date(2022, 5, 1), 'Software Engineer', Decimal('85000.00')),
 (2, 'Jane', 'Smith', 'jane.smith@example.com', datetime.date(2023, 3, 15), 'Data Scientist', Decimal('92000.00')),
 (3, 'Alice', 'Johnson', 'alice.johnson@example.com', datetime.date(2024, 5, 1), 'Engineer', Decimal('95000.00')),
 (4, 'Mark', 'Taylor', 'mark.taylor@example.com', datetime.date(2022, 11, 15), 'Manager', Decimal('100000.00')),
 (5, 'Gowtham', 'sb', 'mark.taylor@example.com', datetime.date(2022, 11, 15), 'Data Engineer', Decimal('100000.00')),
 (6, 'Peter', 'sb', 'mark.taylor@example.com', datetime.date(2022, 11, 15), 'Data Engineer', Decimal('120000.00'))]

In [11]:
%%sql 
select employee_id,
concat (first_name, '-', last_name) as full_name
from employees
where salary >= 95000

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(3, 'Alice-Johnson'), (4, 'Mark-Taylor'), (5, 'Gowtham-sb'), (6, 'Peter-sb')]

In [12]:
%%sql
# Insted of giving this long logic can just create a view and give 
create or replace view High_employee_details as
    select employee_id,
    concat (first_name, '-', last_name) as full_name,
    salary
    from employees
    where salary >= 95000

 * mysql+mysqlconnector://root:***@localhost/mydb
0 rows affected.

[]

In [13]:
%%sql
select * from high_employee_details

 * mysql+mysqlconnector://root:***@localhost/mydb
4 rows affected.

[(3, 'Alice-Johnson', Decimal('95000.00')),
 (4, 'Mark-Taylor', Decimal('100000.00')),
 (5, 'Gowtham-sb', Decimal('100000.00')),
 (6, 'Peter-sb', Decimal('120000.00'))]